app/services/score_loader.rb

SELECT "scores".* FROM "scores" WHERE "scores"."timestamp" = $1 LIMIT $2  [["timestamp", "1653742980"], ["LIMIT", 1]]
INSERT INTO "scores" ("timestamp", "unit", "value") VALUES ($1, $2, $3) RETURNING "id"  [["timestamp", "1653742980"], ["unit", "C"], ["value", 15.5]]
---
  def self.call
    requested_data.each do |element|
      finded_score = Score.find_by(timestamp: element["EpochTime"].to_s)

      unless finded_score
        Score.create!(
          timestamp: element["EpochTime"].to_s,
          unit: element["Temperature"]["Metric"]["Unit"],
          value: element["Temperature"]["Metric"]["Value"].to_f.round(2)
        )