app/controllers/api/v1/weather_controller.rb

SELECT "scores".* FROM "scores" ORDER BY "scores"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
      def current
        data = Score.last

SELECT "scores".* FROM "scores" WHERE "scores"."timestamp" = $1 LIMIT $2  [["timestamp", "1653721080"], ["LIMIT", 1]]
---
      def by_time
        data = Score.find_by(timestamp: params[:selected_time])

SELECT "scores".* FROM "scores" ORDER BY "scores"."id" DESC LIMIT $1  [["LIMIT", 24]]
---
      def daily_scores
        Score.last(24)